In [1]:
import pandas as pd

In [2]:
# 2 main data types in pandas
series = pd.Series(["BMW", "Toyota", "Honda"])

In [3]:
series

0       BMW
1    Toyota
2     Honda
dtype: object

In [4]:
# series = 1-dimensional

In [5]:
colours = pd.Series(["Red", "Blue", "White"])

In [6]:
#dataframe = 2-dimensional

In [7]:
sample_dataframe = pd.DataFrame({"Car Make": series, "Colour": colours})

In [8]:
sales_data = pd.read_csv("https://raw.githubusercontent.com/mrdbourke/zero-to-mastery-ml/master/data/car-sales-extended.csv")
sales_data

       Make Colour  Odometer (KM)  Doors  Price
0     Honda  White          35431      4  15323
1       BMW   Blue         192714      5  19943
2     Honda  White          84714      4  28343
3    Toyota  White         154365      4  13434
4    Nissan   Blue         181577      3  14043
..      ...    ...            ...    ...    ...
995  Toyota  Black          35820      4  32042
996  Nissan  White         155144      3   5716
997  Nissan   Blue          66604      4  31570
998   Honda  White         215883      4   4001
999  Toyota   Blue         248360      4  12732

[1000 rows x 5 columns]

In [9]:
# exporting a dataframe
sales_data.to_csv("exported_car_sales.csv", index=False)

## DESCRIBE DATA

In [10]:
sales_data.dtypes

Make             object
Colour           object
Odometer (KM)     int64
Doors             int64
Price             int64
dtype: object

In [11]:
columns = sales_data.columns
columns

Index(['Make', 'Colour', 'Odometer (KM)', 'Doors', 'Price'], dtype='object')

In [13]:
sales_data.index

RangeIndex(start=0, stop=1000, step=1)

In [15]:
sales_data.describe()

       Odometer (KM)        Doors         Price
count    1000.000000  1000.000000   1000.000000
mean   131073.708000     4.014000  16045.665000
std     68859.723885     0.379405   8630.794219
min     10148.000000     3.000000   2796.000000
25%     71238.000000     4.000000   9481.500000
50%    131202.000000     4.000000  14264.000000
75%    192372.750000     4.000000  20738.750000
max    249860.000000     5.000000  52458.000000

In [16]:
sales_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           1000 non-null   object
 1   Colour         1000 non-null   object
 2   Odometer (KM)  1000 non-null   int64
 3   Doors          1000 non-null   int64
 4   Price          1000 non-null   int64
dtypes: int64(3), object(2)
memory usage: 39.2+ KB

In [18]:
sales_data.mean()

Odometer (KM)    131073.708
Doors                 4.014
Price             16045.665
dtype: float64

In [19]:
car_prices = pd.Series([1500, 3000, 9000, 25000])
car_prices.mean()

9625.0

In [20]:
sales_data.sum()

Make             HondaBMWHondaToyotaNissanHondaToyotaHondaNissa...
Colour           WhiteBlueWhiteWhiteBlueRedBlueWhiteWhiteBlueWh...
Odometer (KM)                                            131073708
Doors                                                         4014
Price                                                     16045665
dtype: object

In [22]:
sales_data["Price"].sum()

16045665

## Viewing and Describing Data

In [23]:
sales_data.head()

     Make Colour  Odometer (KM)  Doors  Price
0   Honda  White          35431      4  15323
1     BMW   Blue         192714      5  19943
2   Honda  White          84714      4  28343
3  Toyota  White         154365      4  13434
4  Nissan   Blue         181577      3  14043

In [25]:
sales_data.head(100)

      Make Colour  Odometer (KM)  Doors  Price
0    Honda  White          35431      4  15323
1      BMW   Blue         192714      5  19943
2    Honda  White          84714      4  28343
3   Toyota  White         154365      4  13434
4   Nissan   Blue         181577      3  14043
..     ...    ...            ...    ...    ...
95   Honda   Blue         143707      4  16337
96  Toyota   Blue          29856      4  11392
97  Toyota  Black         133433      4  16519
98  Toyota    Red         147455      4  22296
99   Honda   Blue          48069      4  12196

[100 rows x 5 columns]

In [26]:
sales_data.tail(20)

       Make Colour  Odometer (KM)  Doors  Price
980  Toyota   Blue         230314      4   6720
981  Toyota  White         129454      4   6446
982   Honda  White         238172      4  13273
983  Toyota    Red         183330      4  14671
984  Nissan   Blue         157235      4   4196
985   Honda   Blue         216250      4   9691
986   Honda  White          71934      4  26882
987   Honda  White         215235      4   3825
988  Nissan  Black         248736      4   8358
989  Toyota    Red          41735      4  13928
990  Toyota  White         173408      4   8082
991   Honda   Blue         235985      4   9184
992   Honda  Green          54721      4  27419
993  Nissan  Black         162523      4   4696
994     BMW   Blue         163322      3  31666
995  Toyota  Black          35820      4  32042
996  Nissan  White         155144      3   5716
997  Nissan   Blue          66604      4  31570
998   Honda  White         215883      4   4001
999  Toyota   Blue         248360      4  12732

In [29]:
# .loc & .iloc
animals = pd.Series(["cat", "dog", "bird", "panda", "octopus", "snake", "gerbil"], index=[2, 3, 8, 4, 9, 7, 6])
animals

2        cat
3        dog
8       bird
4      panda
9    octopus
7      snake
6     gerbil
dtype: object

In [30]:
animals.loc[3]

'dog'

In [31]:
animals.iloc[3]

'panda'

In [32]:
sales_data.loc[:3] # works with slicing

     Make Colour  Odometer (KM)  Doors  Price
0   Honda  White          35431      4  15323
1     BMW   Blue         192714      5  19943
2   Honda  White          84714      4  28343
3  Toyota  White         154365      4  13434

In [35]:
sales_data["Odometer (KM)"]

0       35431
1      192714
2       84714
3      154365
4      181577
        ...
995     35820
996    155144
997     66604
998    215883
999    248360
Name: Odometer (KM), Length: 1000, dtype: int64

In [34]:
sales_data.Colour # wont work with spaces in name

0      White
1       Blue
2      White
3      White
4       Blue
       ...
995    Black
996    White
997     Blue
998    White
999     Blue
Name: Colour, Length: 1000, dtype: object

In [37]:
sales_data[sales_data["Make"] == "Toyota"] # boolean indexing

       Make Colour  Odometer (KM)  Doors  Price
3    Toyota  White         154365      4  13434
6    Toyota   Blue         163453      4   8473
15   Toyota   Blue         205592      4  16290
16   Toyota    Red          96742      4  34465
20   Toyota   Blue         124844      4  24130
..      ...    ...            ...    ...    ...
983  Toyota    Red         183330      4  14671
989  Toyota    Red          41735      4  13928
990  Toyota  White         173408      4   8082
995  Toyota  Black          35820      4  32042
999  Toyota   Blue         248360      4  12732

[398 rows x 5 columns]